#Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

last_name = input("Введите вашу фамилию: ")
first_name = input("Введите ваше имя: ")
middle_name = input("Введите ваше отчество: ")
age = input("Введите ваш возраст: ")
passport_serial = input("Введите вашу серию паспорта: ")
passport = input("Введите ваш номер паспорта: ")
#тест
print(f"ФИО: {last_name} {first_name} {middle_name}\nВозраст: {age}\nПаспорт: {passport_serial} {passport}")

